In [5]:
import pandas as pd

<h5> 2877 . Create DataFrame from a list</h5>

In [6]:

student_data = [[1,15],[2,11],[3,11],[4,20]]
data = pd.DataFrame(student_data, columns=['student_id', 'Age'], index=None)
data

   student_id  Age
0           1   15
1           2   11
2           3   11
3           4   20

<h5>2891. Method Chaining</h5>

In [7]:
#Write a solution to list the names of animals that weigh strictly more than 100 kilograms.
data = {
    'name': ['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
    'species': ['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
    'age': [98, 50, 6, 45, 100, 26],
    'weight': [464, 41, 328, 463, 50, 349]
}

animals = pd.DataFrame(data)
animals.sort_values(by='weight', ascending=False, inplace=True)
a=animals[animals['weight'] > 100]['name']
a = pd.DataFrame(a)
a

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex

<h5> 2878 Get the size of the dataframe.</h5>

In [8]:
players = [
    {"player_id": 846, "name": "Mason", "age": 21, "position": "Forward", "team": "RealMadrid"},
    {"player_id": 749, "name": "Riley", "age": 30, "position": "Winger", "team": "Barcelona"},
    {"player_id": 155, "name": "Bob", "age": 28, "position": "Striker", "team": "ManchesterUnited"},
    {"player_id": 583, "name": "Isabella", "age": 32, "position": "Goalkeeper", "team": "Liverpool"},
    {"player_id": 388, "name": "Zachary", "age": 24, "position": "Midfielder", "team": "BayernMunich"},
    {"player_id": 883, "name": "Ava", "age": 23, "position": "Defender", "team": "Chelsea"},
    {"player_id": 355, "name": "Violet", "age": 18, "position": "Striker", "team": "Juventus"},
    {"player_id": 247, "name": "Thomas", "age": 27, "position": "Striker", "team": "ParisSaint-Germain"},
    {"player_id": 761, "name": "Jack", "age": 33, "position": "Midfielder", "team": "ManchesterCity"},
    {"player_id": 642, "name": "Charlie", "age": 36, "position": "Center-back", "team": "Arsenal"}
]

players=pd.DataFrame(players)
a = players.shape
a = list(a)
type(a)

list

<h5>2879. Display the first three rows.</h5>

In [9]:
employees = [
    {"employee_id": 3, "name": "Bob", "department": "Operations", "salary": 48675},
    {"employee_id": 90, "name": "Alice", "department": "Sales", "salary": 11096},
    {"employee_id": 9, "name": "Tatiana", "department": "Engineering", "salary": 33805},
    {"employee_id": 60, "name": "Annabelle", "department": "InformationTechnology", "salary": 37678},
    {"employee_id": 49, "name": "Jonathan", "department": "HumanResources", "salary": 23793},
    {"employee_id": 43, "name": "Khaled", "department": "Administration", "salary": 40454}
]

employees = pd.DataFrame(employees)
# employees.iloc[:3,1] # works on indexing 
# employees.loc[:3, 'name'] # works on index names(row names) and column names
employees.iloc[:3,1 : 3]

      name   department
0      Bob   Operations
1    Alice        Sales
2  Tatiana  Engineering

<h5> 2880. Select Data</h5>

In [10]:
#Write a solution to select the name and age of the student with student_id = 101.
data = {
    "student_id": [101, 53, 100, 3],
    "name": ["Ulysses", "William", "Henry", "Henry"],
    "age": [13, 10, 6, 11]
}

students = pd.DataFrame(data)
a = (students[students['student_id']==101]).loc[:,'name':'age']

data  = students[students['student_id']==101][['name','age']]
# data

data = students.loc[students['student_id']==101,'name':]
data

data = students.loc[students['student_id']==101,'name':'age']
data

data = students.loc[students['student_id']==101,['name','age']]
data


data =  students[students['student_id']==101][1:2] #this wont work because [1:2] is applied on the result of students[students['student_id']==101] 
'''which is same like doing data = students[students['student_id']==101] and then data = data[1:2]'''

data

data = students[students['student_id']==101].iloc[:,1:3]  # using iloc
data

data = students.iloc[(students['student_id']==101).values,1:3] # using iloc
data

data = students.iloc[(students['student_id']==101).values][['name','age']]
data

# (students['student_id']==101) returns pandas series but .iloc expects array so ().values converts it to numpy boolean array.

      name  age
0  Ulysses   13

<h5> 2881. Create New Column</h5>

In [11]:
data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}

employees = pd.DataFrame(data)
employees['bonus'] = 2*employees['salary']
employees

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

2882. Drop Duplicate Rows

Delete the rows based on the duplicate emails keep the first occurence delete rest.

In [12]:
data =pd.DataFrame({
    'customer_id': [1, 2, 3, 4, 5, 6],
    'name': ['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
    'email': [
        'emily@example.com',
        'michael@example.com',
        'sarah@example.com',
        'john@example.com',
        'john@example.com',
        'alice@example.com'
    ]
})

duplicates = data[data.duplicated('email')]

data.drop(duplicates.index)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

In [13]:
df = pd.DataFrame([
    [1, 2],
    [3, 4]
], columns=['A', 'A'])

df.insert(2,"A",[2,3],allow_duplicates=True)

print(df)

   A  A  A
0  1  2  2
1  3  4  3

iterating in dataframe over rows.

In [14]:
import pandas as pd

df = pd.DataFrame({'name': ['Alice', 'Bob'], 'age': [25, 30]})

for index, row in df.iterrows():
    print(f"Index: {index}, Name: {row['name']}, Age: {row['age']}")

Index: 0, Name: Alice, Age: 25
Index: 1, Name: Bob, Age: 30

2883. Drop Missing Data.
There are some rows having missing values in the name column.

In [15]:
data = {
    'student_id': [32, 217, 779, 849],
    'name': ['Piper', None, 'Georgia', 'Willow'],
    'age': [5, 19, 20, None]
}

df = pd.DataFrame(data)

df.dropna() # this drops the row having any value as null or none we have to drop only that row where name is none or null

df.dropna(subset=['name']) # this will only drop the row in which name is na or none 

df.dropna(axis='columns')

   student_id
0          32
1         217
2         779
3         849

2885. Rename Columns
Write a solution to rename the columns as follows:

id to student_id,
first to first_name,
last to last_name,
age to age_in_years

In [16]:
data = {
    'id': [1, 2, 3, 4, 5],
    'first': ['Mason', 'Ava', 'Taylor', 'Georgia', 'Thomas'],
    'last': ['King', 'Wright', 'Hall', 'Thompson', 'Moore'],
    'age': [6, 7, 16, 18, 10]
}

df = pd.DataFrame(data)

df.columns = ['student_id', 'first_name', 'last_name', 'age_in_years']
df.columns
df

   student_id first_name last_name  age_in_years
0           1      Mason      King             6
1           2        Ava    Wright             7
2           3     Taylor      Hall            16
3           4    Georgia  Thompson            18
4           5     Thomas     Moore            10

595. Big Countries.

In [17]:
data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

df = pd.DataFrame(data)
a = df[df['population'] >= 25000000]
b = df[df['area'] >= 3000000]

c = a.combine_first(b)
c = c.loc[:,['name','area','population']]
c

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

2886. Change Data Type

In [18]:
data = {
    'student_id': [1, 2],
    'name': ['Ava', 'Kate'],
    'age': [6, 15],
    'grade': [73.0, 87.0]
}

df = pd.DataFrame(data)

df['grade'] = df['grade'].astype(int)
df.dtypes

student_id     int64
name          object
age            int64
grade          int64
dtype: object

2888: Reshape data concatenate.

In [19]:
data = {
    'student_id': [1, 2, 3, 4],
    'name': ['Mason', 'Ava', 'Taylor', 'Georgia'],
    'age': [8, 6, 15, 17]
}

df1 = pd.DataFrame(data)
data = {
    'student_id': [5, 6],
    'name': ['Leo', 'Alex'],
    'age': [7, 7]
}

df2 = pd.DataFrame(data)

df_combined = pd.concat((df1,df2), ignore_index=True)

# 2889 Reshape Data: Pivot

In [20]:
data = {
    'city': ['Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville',
             'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
    'month': ['January', 'February', 'March', 'April', 'May',
              'January', 'February', 'March', 'April', 'May'],
    'temperature': [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]
}

df = pd.DataFrame(data)

month_wise_temp = df.pivot(index=["month"], columns=["city"], values="temperature")
month_wise_temp

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

2890. Reshape Data: Melt

In [21]:
data = {
    'product': ['Umbrella', 'SleepingBag'],
    'quarter_1': [417, 800],
    'quarter_2': [224, 936],
    'quarter_3': [379, 93],
    'quarter_4': [611, 875]
}

df = pd.DataFrame(data)

pd.melt(df,id_vars='product', value_vars=['quarter_1','quarter_2', 'quarter_3', 'quarter_4'], value_name='sales', var_name='quarter')

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

2887. Fill Missing Data

In [22]:
# fill 0 in place of None in quantity column.
data = {
    'name': ['Wristwatch', 'WirelessEarbuds', 'GolfClubs', 'Printer'],
    'quantity': [None, None, 779, 849],
    'price': [135, 821, 9319, 3051]
}

df = pd.DataFrame(data)

a = df['quantity'].isna()
df.loc[a,'quantity'] = 0
df['quantity'] = df['quantity'].astype(int)
df

df['quantity'].fillna(0,inplace=True) # using fillna function one liner.
df

df.fillna(value={'quantity': 0}, inplace = True) # solution 2.

df.loc[df['quantity'].isnull(),'quantity'] = 0 # solution 3.
df
 # ---- using loop.
result = []
for i in df.quantity:
    if pd.isna(i):
        result.append(0)
        continue
    result.append(i)
df['quantity'] = result

# ------

196 Delete Duplicate emails

In [23]:
data = {
    'id': [4, 2, 3],
    'email': ['john@example.com', 'bob@example.com', 'john@example.com']
}

# keep the email with smallest id.
df = pd.DataFrame(data)

df.sort_values(by='id', ascending=True, inplace=True)
df.drop_duplicates(subset='email', keep='first', inplace=True)
df

   id             email
1   2   bob@example.com
2   3  john@example.com

181. Employees Earning more than their managers.

In [ ]:
data = {
    'id': [1, 3, 2],
    'name': ['Mark', 'Jack', 'Alan'],
    'salary': [40000, 30000, 20000],
    'managerId': [3, 2, None]  # use None for null values
}

df = pd.DataFrame(data)

n = df.last_valid_index()

# df = df.sort_values(by='id')

lst = df.id


ans = []

# if(pd.notna(n)):
#     for i in lst:
#         a = df.loc[df['id']==i]['managerId']
        
#         a = int(a[0])
#         if pd.notna(a):
#             m_id = df.loc[df['id']==i]['managerId']
#             m_id = int(m_id[0])
#             print(m_id)
#             if df.loc[df['id']==m_id]['salary'] < df.loc[df['id']==i]['salary']:
#                 ans.append(df.loc[df['id']==m_id]['name'])




a = df.loc[df['id']==3]['managerId']

<bound method NDFrame.last of 1    2.0
Name: managerId, dtype: float64>